The data structure of pandas The pandas library essentially has three data structures:
1. Series
2. DataFrame
3. Panel

In [3]:
#Series
import pandas as pd
import numpy as np
pd.Series(np.random.randn(5), index=['a','b','c','d','e'])

a   -0.317944
b   -0.008942
c   -0.344777
d   -1.349406
e    0.399736
dtype: float64

In [4]:
d = {'A':10, 'B':20, 'C':30}
pd.Series(d)

A    10
B    20
C    30
dtype: int64

In [10]:
d = {'c1': pd.Series(['A', 'B', 'C']),
'c2': pd.Series([1, 2., 3., 4.])}
df = pd.DataFrame(d)
print(df)

    c1   c2
0    A  1.0
1    B  2.0
2    C  3.0
3  NaN  4.0

In [12]:
d = {'c1': ['A', 'B', 'C', 'D'],
'c2': [1, 2.0, 3.0, 4.0]}
df = pd.DataFrame(d)
print(df)

  c1   c2
0  A  1.0
1  B  2.0
2  C  3.0
3  D  4.0

In [14]:
d = {'Item1':pd.DataFrame(np.random.randn(4,3)),
     'Item2':pd.DataFrame(np.random.randn(4,2))}

In [18]:
d1 = pd.read_csv('Student_Weight_Status_Category_Reporting_Results__Beginning_2010.csv')
d1[0:5]['AREA NAME']

0    RAVENA COEYMANS SELKIRK CENTRAL SCHOOL DISTRICT
1    RAVENA COEYMANS SELKIRK CENTRAL SCHOOL DISTRICT
2    RAVENA COEYMANS SELKIRK CENTRAL SCHOOL DISTRICT
3                        COHOES CITY SCHOOL DISTRICT
4                        COHOES CITY SCHOOL DISTRICT
Name: AREA NAME, dtype: object

In [16]:
d = {'c1':pd.Series(['A','B','C']), 'c2':pd.Series([1,2.,3.,4.])}
df = pd.DataFrame(d)
df.to_csv('sample_data.csv')

In [ ]:
#DataBase 
pd.read_sql_table(table_name, con)
pd.read_sql_query(sql, con)

In [20]:
d1['Location 1'].isnull()

0       False
1       False
2       False
3       False
4       False
        ...
3265    False
3266    False
3267     True
3268     True
3269     True
Name: Location 1, Length: 3270, dtype: bool

In [21]:
d1['Location 1'].isnull().value_counts() #number of missingvalue

False    3246
True       24
Name: Location 1, dtype: int64

In [22]:
d1 = d1['Location 1'].dropna()

In [23]:
d1 = d1.dropna(how='any')
d1

0       15 MOUNTAIN RD\nRAVENA, NY 12143\n(42.47227638...
1       15 MOUNTAIN RD\nRAVENA, NY 12143\n(42.47227638...
2       15 MOUNTAIN RD\nRAVENA, NY 12143\n(42.47227638...
3       7 BEVAN ST\nCOHOES, NY 12047\n(42.771285452000...
4       7 BEVAN ST\nCOHOES, NY 12047\n(42.771285452000...
                              ...
3262                                   (42.6671, -77.063)
3263                                   (42.6671, -77.063)
3264                                  (42.5263, -76.9771)
3265                                  (42.5263, -76.9771)
3266                                  (42.5263, -76.9771)
Name: Location 1, Length: 3246, dtype: object

In [24]:
#Filling the missing data
df = pd.DataFrame(np.random.randn(5, 3), index=['a0', 'a10', 'a20', 'a30', 'a40'], columns=['X','Y','Z'])
df

            X         Y         Z
a0  -0.482242  0.256932 -0.714356
a10  0.235598  0.555344  0.164434
a20  0.252776 -2.150856  1.376185
a30 -0.479614  0.071310  0.192676
a40  1.322358 -0.600493 -0.906919

In [26]:
df2 = df.reindex(['a0', 'a1', 'a10', 'a11', 'a20', 'a21',
'a30', 'a31', 'a40', 'a41'])
df2

            X         Y         Z
a0  -0.482242  0.256932 -0.714356
a1        NaN       NaN       NaN
a10  0.235598  0.555344  0.164434
a11       NaN       NaN       NaN
a20  0.252776 -2.150856  1.376185
a21       NaN       NaN       NaN
a30 -0.479614  0.071310  0.192676
a31       NaN       NaN       NaN
a40  1.322358 -0.600493 -0.906919
a41       NaN       NaN       NaN

In [32]:
df2.fillna(0)

            X         Y         Z
a0  -0.482242  0.256932 -0.714356
a1   0.000000  0.000000  0.000000
a10  0.235598  0.555344  0.164434
a11  0.000000  0.000000  0.000000
a20  0.252776 -2.150856  1.376185
a21  0.000000  0.000000  0.000000
a30 -0.479614  0.071310  0.192676
a31  0.000000  0.000000  0.000000
a40  1.322358 -0.600493 -0.906919
a41  0.000000  0.000000  0.000000

In [35]:
#df2.fillna(method='pad') #filling with forward propagation
df2.fillna(df2.mean())

            X         Y         Z
a0  -0.482242  0.256932 -0.714356
a1   0.169775 -0.373553  0.022404
a10  0.235598  0.555344  0.164434
a11  0.169775 -0.373553  0.022404
a20  0.252776 -2.150856  1.376185
a21  0.169775 -0.373553  0.022404
a30 -0.479614  0.071310  0.192676
a31  0.169775 -0.373553  0.022404
a40  1.322358 -0.600493 -0.906919
a41  0.169775 -0.373553  0.022404

In [36]:
d2 = pd.read_csv('Student_Weight_Status_Category_Reporting_Results__Beginning_2010.csv')
d2['AREA NAME'][0:5]

0    RAVENA COEYMANS SELKIRK CENTRAL SCHOOL DISTRICT
1    RAVENA COEYMANS SELKIRK CENTRAL SCHOOL DISTRICT
2    RAVENA COEYMANS SELKIRK CENTRAL SCHOOL DISTRICT
3                        COHOES CITY SCHOOL DISTRICT
4                        COHOES CITY SCHOOL DISTRICT
Name: AREA NAME, dtype: object

In [38]:
d2['AREA NAME'][0:5].str.extract('(\w+)')

        0
0  RAVENA
1  RAVENA
2  RAVENA
3  COHOES
4  COHOES

In [39]:
d2['AREA NAME'][0:5].str.extract('(\w+)\s(\w+)')

        0         1
0  RAVENA  COEYMANS
1  RAVENA  COEYMANS
2  RAVENA  COEYMANS
3  COHOES      CITY
4  COHOES      CITY

In [40]:
d2[d2['GRADE LEVEL'] == 'ELEMENTARY']

,LOCATION CODE,COUNTY,AREA NAME,REGION,SCHOOL YEARS,NO. OVERWEIGHT,PCT OVERWEIGHT,NO. OBESE,PCT OBESE,NO. OVERWEIGHT OR OBESE,PCT OVERWEIGHT OR OBESE,GRADE LEVEL,AREA TYPE,STREET ADDRESS,CITY,STATE,ZIP CODE,Location 1
1,10402,ALBANY,RAVENA COEYMANS SELKIRK CENTRAL SCHOOL DISTRICT,NORTHEASTERN NEW YORK,2012-2013,74.0,19.2%,72.0,18.7%,146.0,37.9%,ELEMENTARY,SCHOOL DISTRICT,15 MOUNTAIN RD,RAVENA,NY,12143.0,"15 MOUNTAIN RD\nRAVENA, NY 12143\n(42.47227638..."
4,10500,ALBANY,COHOES CITY SCHOOL DISTRICT,NORTHEASTERN NEW YORK,2012-2013,58.0,16.1%,89.0,24.7%,147.0,40.8%,ELEMENTARY,SCHOOL DISTRICT,7 BEVAN ST,COHOES,NY,12047.0,"7 BEVAN ST\nCOHOES, NY 12047\n(42.771285452000..."
7,10601,ALBANY,SOUTH COLONIE CENTRAL SCHOOL DISTRICT,NORTHEASTERN NEW YORK,2012-2013,145.0,17.4%,169.0,20.3%,314.0,37.8%,ELEMENTARY,SCHOOL DISTRICT,102 LORALEE DR,ALBANY,NY,12205.0,"102 LORALEE DR\nALBANY, NY 12205\n(42.73352407..."
10,10623,ALBANY,NORTH COLONIE CENTRAL SCHOOL DISTRICT,NORTHEASTERN NEW YORK,2012-2013,94.0,15.5%,78.0,12.9%,172.0,28.4%,ELEMENTARY,SCHOOL DISTRICT,91 FIDDLERS LN,LATHAM,NY,12110.0,"91 FIDDLERS LN\nLATHAM, NY 12110\n(42.72935391..."
13,10701,ALBANY,GREEN ISLAND UNION FREE SCHOOL DISTRICT,NORTHEASTERN NEW YORK,2012-2013,NaN,NaN,15.0,35.7%,15.0,35.7%,ELEMENTARY,SCHOOL DISTRICT,171 HUDSON AVE,GREEN ISLAND,NY,12183.0,"171 HUDSON AVE\nGREEN ISLAND, NY 12183\n(42.74..."
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3256,671201,WYOMING,PERRY CENTRAL SCHOOL,WESTERN NEW YORK,2010-2012,35.0,18.1%,49.0,25.4%,84.0,43.5%,ELEMENTARY,SCHOOL DISTRICT,33 WATKINS AVE,PERRY,NY,14530.0,"(42.7236, -78.003)"
3259,671501,WYOMING,WARSAW CENTRAL SCHOOL,WESTERN NEW YORK,2010-2012,45.0,21.7%,45.0,21.7%,90.0,43.5%,ELEMENTARY,SCHOOL DISTRICT,153 W BUFFALO ST,WARSAW,NY,14569.0,"(42.7403, -78.1382)"
3262,680601,YATES,PENN YAN CENTRAL SCHOOL,FINGER LAKES,2010-2012,45.0,18.2%,48.0,19.4%,93.0,37.7%,ELEMENTARY,SCHOOL DISTRICT,1 SCHOOL DR,PENN YAN,NY,14527.0,"(42.6671, -77.063)"
3265,680801,YATES,DUNDEE CENTRAL SCHOOL,FINGER LAKES,2010-2012,28.0,15.6%,20.0,11.1%,48.0,26.7%,ELEMENTARY,SCHOOL DISTRICT,55 WATER ST,DUNDEE,NY,14837.0,"(42.5263, -76.9771)"
3268,700000,NaN,WESTERN NEW YORK,WESTERN NEW YORK,2010-2012,5827.0,15.2%,6587.0,17.1%,12414.0,32.3%,ELEMENTARY,REGION,NaN,NaN,NaN,NaN,NaN

In [42]:
d2['AREA NAME'][0:5].str.upper()

0    RAVENA COEYMANS SELKIRK CENTRAL SCHOOL DISTRICT
1    RAVENA COEYMANS SELKIRK CENTRAL SCHOOL DISTRICT
2    RAVENA COEYMANS SELKIRK CENTRAL SCHOOL DISTRICT
3                        COHOES CITY SCHOOL DISTRICT
4                        COHOES CITY SCHOOL DISTRICT
Name: AREA NAME, dtype: object

In [43]:
d2['AREA NAME'][0:5].str.lower()

0    ravena coeymans selkirk central school district
1    ravena coeymans selkirk central school district
2    ravena coeymans selkirk central school district
3                        cohoes city school district
4                        cohoes city school district
Name: AREA NAME, dtype: object

In [44]:
d2['AREA NAME'][0:5].str.len()

0    47
1    47
2    47
3    27
4    27
Name: AREA NAME, dtype: int64

In [45]:
d2['AREA NAME'][0:5].str.replace('DISTRICT$', 'DIST')

/tmp/ipykernel_14291/261637303.py:1: FutureWarning: The default value of regex will change from True to False in a future version.
  d2['AREA NAME'][0:5].str.replace('DISTRICT$', 'DIST')

0    RAVENA COEYMANS SELKIRK CENTRAL SCHOOL DIST
1    RAVENA COEYMANS SELKIRK CENTRAL SCHOOL DIST
2    RAVENA COEYMANS SELKIRK CENTRAL SCHOOL DIST
3                        COHOES CITY SCHOOL DIST
4                        COHOES CITY SCHOOL DIST
Name: AREA NAME, dtype: object

MERGING DATA

In [49]:
d2[['AREA NAME', 'COUNTY']][0:5]

                                         AREA NAME  COUNTY
0  RAVENA COEYMANS SELKIRK CENTRAL SCHOOL DISTRICT  ALBANY
1  RAVENA COEYMANS SELKIRK CENTRAL SCHOOL DISTRICT  ALBANY
2  RAVENA COEYMANS SELKIRK CENTRAL SCHOOL DISTRICT  ALBANY
3                      COHOES CITY SCHOOL DISTRICT  ALBANY
4                      COHOES CITY SCHOOL DISTRICT  ALBANY

In [50]:
p1 = d2[['AREA NAME', 'COUNTY']][0:2]
p2 = d2[['AREA NAME', 'COUNTY']][2:5]

In [51]:
pd.concat([p1, p2])

                                         AREA NAME  COUNTY
0  RAVENA COEYMANS SELKIRK CENTRAL SCHOOL DISTRICT  ALBANY
1  RAVENA COEYMANS SELKIRK CENTRAL SCHOOL DISTRICT  ALBANY
2  RAVENA COEYMANS SELKIRK CENTRAL SCHOOL DISTRICT  ALBANY
3                      COHOES CITY SCHOOL DISTRICT  ALBANY
4                      COHOES CITY SCHOOL DISTRICT  ALBANY

In [52]:
#The combined pieces can be identified by assigning a key:
concatenated = pd.concat([p1, p2], keys = ['p1', 'p2'])
concatenated

                                            AREA NAME  COUNTY
p1 0  RAVENA COEYMANS SELKIRK CENTRAL SCHOOL DISTRICT  ALBANY
   1  RAVENA COEYMANS SELKIRK CENTRAL SCHOOL DISTRICT  ALBANY
p2 2  RAVENA COEYMANS SELKIRK CENTRAL SCHOOL DISTRICT  ALBANY
   3                      COHOES CITY SCHOOL DISTRICT  ALBANY
   4                      COHOES CITY SCHOOL DISTRICT  ALBANY

In [54]:
#concatenated.ix['p1']

In [57]:
data = d2[d2['GRADE LEVEL'] == 'ELEMENTARY']
data.head()

,LOCATION CODE,COUNTY,AREA NAME,REGION,SCHOOL YEARS,NO. OVERWEIGHT,PCT OVERWEIGHT,NO. OBESE,PCT OBESE,NO. OVERWEIGHT OR OBESE,PCT OVERWEIGHT OR OBESE,GRADE LEVEL,AREA TYPE,STREET ADDRESS,CITY,STATE,ZIP CODE,Location 1
1,10402,ALBANY,RAVENA COEYMANS SELKIRK CENTRAL SCHOOL DISTRICT,NORTHEASTERN NEW YORK,2012-2013,74.0,19.2%,72.0,18.7%,146.0,37.9%,ELEMENTARY,SCHOOL DISTRICT,15 MOUNTAIN RD,RAVENA,NY,12143.0,"15 MOUNTAIN RD\nRAVENA, NY 12143\n(42.47227638..."
4,10500,ALBANY,COHOES CITY SCHOOL DISTRICT,NORTHEASTERN NEW YORK,2012-2013,58.0,16.1%,89.0,24.7%,147.0,40.8%,ELEMENTARY,SCHOOL DISTRICT,7 BEVAN ST,COHOES,NY,12047.0,"7 BEVAN ST\nCOHOES, NY 12047\n(42.771285452000..."
7,10601,ALBANY,SOUTH COLONIE CENTRAL SCHOOL DISTRICT,NORTHEASTERN NEW YORK,2012-2013,145.0,17.4%,169.0,20.3%,314.0,37.8%,ELEMENTARY,SCHOOL DISTRICT,102 LORALEE DR,ALBANY,NY,12205.0,"102 LORALEE DR\nALBANY, NY 12205\n(42.73352407..."
10,10623,ALBANY,NORTH COLONIE CENTRAL SCHOOL DISTRICT,NORTHEASTERN NEW YORK,2012-2013,94.0,15.5%,78.0,12.9%,172.0,28.4%,ELEMENTARY,SCHOOL DISTRICT,91 FIDDLERS LN,LATHAM,NY,12110.0,"91 FIDDLERS LN\nLATHAM, NY 12110\n(42.72935391..."
13,10701,ALBANY,GREEN ISLAND UNION FREE SCHOOL DISTRICT,NORTHEASTERN NEW YORK,2012-2013,NaN,NaN,15.0,35.7%,15.0,35.7%,ELEMENTARY,SCHOOL DISTRICT,171 HUDSON AVE,GREEN ISLAND,NY,12183.0,"171 HUDSON AVE\nGREEN ISLAND, NY 12183\n(42.74..."

In [58]:
data['NO. OBESE'].mean()

213.4159378036929

In [59]:
data['NO. OBESE'].sum()

219605.0

In [60]:
data['NO. OBESE'].max()

48843.0

In [61]:
data['NO. OBESE'].min()

5.0

In [62]:
data['NO. OBESE'].std()

1690.3831128098116

In [65]:
#count
data = d2[(d2['GRADE LEVEL'] == 'ELEMENTARY') & (d2['COUNTY'] == 'DELAWARE')]
data['COUNTY'].count()

19